# GradientPosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..GradientPosition Property
Gradient Class See Also
---
The property labeled "Position" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GradientPosition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GradientPosition As String
	Get
```

Visual C++
---
```text
public:
static property String^ GradientPosition {
	String^ get ();
}
```

# Remarks
This property is a "AssetPropertyList" of type "AssetPropertyDouble".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace